app/views/businesses/show.html.erb

        <% unless @business.items.nil? %>
            <% @business.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."business_id" = $1  [["business_id", 12]]