app/views/businesses/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."business_id" = $1  [["business_id", 5]]
---
    <% unless @business.items.nil? %>
        <% @business.items.each do |item| %>