app/views/users/show.html.erb

SELECT "businesses".* FROM "businesses" WHERE "businesses"."user_id" = $1  [["user_id", 1]]
---
    <% unless @user.businesses.nil? %>
        <% @user.businesses.each do |business| %>