app/views/items/show.html.erb

SELECT "units".* FROM "units" WHERE "units"."item_id" = $1  [["item_id", 1]]
---
    <% unless @item.units.nil? %>
        <% @item.units.each do |unit| %>