app/controllers/businesses_controller.rb

    def show
        @business = Business.find_by(id: params[:id])
---
SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def create
        @business = Business.new(business_params)
        @business.user_id = current_user.id
        if @business.save
---
INSERT INTO "businesses" ("user_id", "name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["name", "zxcv"], ["description", "zxcvzxcv"], ["created_at", "2021-06-26 07:49:16.967536"], ["updated_at", "2021-06-26 07:49:16.967536"]]

    def edit
        @business = Business.find(params[:id])
---
SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def update
        @business = Business.find(params[:id])
        if @business.update(business_params)
---
SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "businesses" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "businesses"."id" = $4  [["name", "Out-N-In Hotdog"], ["description", "We sell the best hotdogs in California!"], ["updated_at", "2021-06-29 07:07:34.271447"], ["id", 7]]

    def destroy
        @business = Business.find_by(id: params[:id])
        @business.destroy
---
SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "businesses" WHERE "businesses"."id" = $1  [["id", 5]]