app/controllers/businesses_controller.rb

SELECT "businesses".* FROM "businesses" WHERE "businesses"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
    def index
        @businesses = Business.find_by(user_id: current_user.id)