app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @item = Item.find_by(id: params[:id])

INSERT INTO "items" ("business_id", "name", "description", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["business_id", 5], ["name", "test_item"], ["description", "sadfsadf"], ["quantity", 32], ["created_at", "2021-06-26 21:18:11.318381"], ["updated_at", "2021-06-26 21:18:11.318381"]]
---
    def create
        @item = Item.new(item_params)
        if @item.save

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "name" = $1, "description" = $2, "quantity" = $3, "updated_at" = $4 WHERE "items"."id" = $5  [["name", "Medium Cups"], ["description", "16oz - packs of 100"], ["quantity", 50], ["updated_at", "2021-06-29 20:55:06.926733"], ["id", 34]]
---
    def update
        @item = Item.find(params[:id])
        if @item.update(item_params)

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 5]]
---
    def destroy
        @item = Item.find_by(id: params[:id])
        @item.destroy