app/controllers/units_controller.rb

SELECT "units".* FROM "units" WHERE "units"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def show
        @unit = Unit.find_by(id: params[:id])

INSERT INTO "units" ("item_id", "serial_number", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["item_id", 1], ["serial_number", "test"], ["notes", "asdf"], ["created_at", "2021-06-26 19:32:19.842581"], ["updated_at", "2021-06-26 19:32:19.842581"]]
---
    def create
        @unit = Unit.new(unit_params)
        if @unit.save

SELECT "units".* FROM "units" WHERE "units"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def edit
        @unit = Unit.find(params[:id])

SELECT "units".* FROM "units" WHERE "units"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "units" SET "serial_number" = $1, "notes" = $2, "updated_at" = $3 WHERE "units"."id" = $4  [["serial_number", "unit test"], ["notes", ""], ["updated_at", "2021-06-26 22:02:04.299736"], ["id", 5]]
---
    def update
        @unit = Unit.find(params[:id])
        if @unit.update(unit_params)

SELECT "units".* FROM "units" WHERE "units"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "units" WHERE "units"."id" = $1  [["id", 4]]
---
    def destroy
        @unit = Unit.find_by(id: params[:id])
        @unit.destroy